In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [7]:
booldf = df>0

In [8]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [11]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
resultdf = df[df['W']>0]

In [14]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [16]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [17]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [19]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
newind = 'AB CD EF GH IJ'.split()

In [24]:
newind

['AB', 'CD', 'EF', 'GH', 'IJ']

In [25]:
df['States'] = newind

In [26]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     AB
B  0.651118 -0.319318 -0.848077  0.605965     CD
C -2.018168  0.740122  0.528813 -0.589001     EF
D  0.188695 -0.758872 -0.933237  0.955057     GH
E  0.190794  1.978757  2.605967  0.683509     IJ

In [27]:
df.set_index('States')

               W         X         Y         Z
States
AB      2.706850  0.628133  0.907969  0.503826
CD      0.651118 -0.319318 -0.848077  0.605965
EF     -2.018168  0.740122  0.528813 -0.589001
GH      0.188695 -0.758872 -0.933237  0.955057
IJ      0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     AB
B  0.651118 -0.319318 -0.848077  0.605965     CD
C -2.018168  0.740122  0.528813 -0.589001     EF
D  0.188695 -0.758872 -0.933237  0.955057     GH
E  0.190794  1.978757  2.605967  0.683509     IJ

In [29]:
# import numpy as np 
# import pandas as pd

In [30]:
# Index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [31]:
df2 = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [32]:
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [35]:
df2.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [38]:
df2.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [39]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     AB
B  0.651118 -0.319318 -0.848077  0.605965     CD
C -2.018168  0.740122  0.528813 -0.589001     EF
D  0.188695 -0.758872 -0.933237  0.955057     GH
E  0.190794  1.978757  2.605967  0.683509     IJ

In [40]:
df2.index.names = ['Groups','Num']

In [41]:
df2

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [42]:
df2.loc['G2'].loc[2]['B']

0.07295967531703869

In [43]:
df2.loc['G1'].loc[3]['A']

-0.13484072060601238

In [44]:
# ye multa-level-index hotha hai
# iss liye andar janne ke liye SPECIALLY use kro corss-section
# -- > xs <--

In [45]:
df2.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [46]:
#  To get A of G1 and G2 both so loc will be tricky.

In [47]:
df2.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [49]:
df2.xs(3,level='Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

In [50]:
# Comment ho rha hai naa 
# Missing Data

In [51]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [52]:
df3 = pd.DataFrame(d)

In [53]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [55]:
df3.dropna(axis=1)

   C
0  1
1  2
2  3

In [56]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df3.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [58]:
df3.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [61]:
df3.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [64]:
df4 = df3.fillna(value='Fill Value')

In [65]:
df4

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [66]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df4['A']

0           1.0
1           2.0
2    Fill Value
Name: A, dtype: object

In [68]:
df3['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [74]:
df3['B'].fillna(value=df3['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [73]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [75]:
# GroupBy

In [76]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [77]:
gf = pd.DataFrame(data)

In [78]:
gf

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [81]:
byComp = gf.groupby('Company')

In [83]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [84]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [85]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [88]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [89]:
gf.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [92]:
gf.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [93]:
gf.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [94]:
gf.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [95]:
gf.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [96]:
gf.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [99]:
# Byye Byye

In [100]:
# hwy are you here

In [101]:
#  Goo goo bye